app/controllers/books_controller.rb

INSERT INTO `books` (`created_at`, `desc`, `email`, `name`, `updated_at`) VALUES ('2011-11-10 07:35:11', '', NULL, NULL, '2011-11-10 07:35:11')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
UPDATE `books` SET `desc` = '32', `updated_at` = '2011-12-05 14:22:24' WHERE `books`.`id` = 1
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])